### Data

In [3]:
# DATA PERTAMA
import pandas as pd
nama = ['Berti','Ryndes','Arin']
tugas = [95,90,75]
jurusan = ['IF','SI','KA']
df3 = pd.DataFrame({'Nama':nama, 'Tugas':tugas, 'Jurusan':jurusan})
df3

     Nama  Tugas Jurusan
0   Berti     95      IF
1  Ryndes     90      SI
2    Arin     75      KA

In [4]:
# DATA KEDUA
import pandas as pd
nama = ['Berti','Ryndes','Rylo']
uts = [85,84,70]
jurusan = ['IF','SI','SI']
df4 = pd.DataFrame({'Nama':nama, 'UTS':uts, 'Jurusan':jurusan})
df4

     Nama  UTS Jurusan
0   Berti   85      IF
1  Ryndes   84      SI
2    Rylo   70      SI

Inner Merge

In [5]:
# INNER MERGE
df3.merge(df4)

     Nama  Tugas Jurusan  UTS
0   Berti     95      IF   85
1  Ryndes     90      SI   84

Left Merge

In [6]:
# LEFT MERGE
df3.merge(df4, on='Nama', how='left')

     Nama  Tugas Jurusan_x   UTS Jurusan_y
0   Berti     95        IF  85.0        IF
1  Ryndes     90        SI  84.0        SI
2    Arin     75        KA   NaN       NaN

Right Merge

In [7]:
# RIGHT MERGE
df3.merge(df4, on='Nama', how='right')

     Nama  Tugas Jurusan_x  UTS Jurusan_y
0   Berti   95.0        IF   85        IF
1  Ryndes   90.0        SI   84        SI
2    Rylo    NaN       NaN   70        SI

Outer Merge

In [8]:
# OUTER MERGE
df3.merge(df4, on='Nama', how='outer')

     Nama  Tugas Jurusan_x   UTS Jurusan_y
0   Berti   95.0        IF  85.0        IF
1  Ryndes   90.0        SI  84.0        SI
2    Arin   75.0        KA   NaN       NaN
3    Rylo    NaN       NaN  70.0        SI